app/controllers/users_controller.rb

SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `encrypted_password` = '$2a$10$CY7PCoWewUflXhpeuqt2Uu0oDZkk552L0DIH85ikr.FLYvILDPXim', `updated_at` = '2014-04-18 14:08:59' WHERE `users`.`id` = 3
---
    def update

        if user_params[:password].blank?
            user_params.delete(:password)
            user_params.delete(:password_confirmation)
        end

        user = User.find(params[:id])
        level = params[:level].to_i;
        successfully_updated = if needs_password?(@user, user_params)
                                   @user.update(user_params)

SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 1
---
    def destroy
        user = User.find(params[:id])
        if (current_user == user)
            respond_to do |format|
                flash[:error] = "Can not delete own admin account!"
                format.html { redirect_to users_url, notice: "You can't delete yourself" }
                format.json { head :no_content }
            end
        else
            @user.destroy